{
    "English": {
        "page1_title": "Diagnosis Assistant",
        "bmc_0": "Let's keep MDxApp free!",
        "bmc_1": "By clicking here:",
        "bmc_2": "Or use this QR code:",
        "page1_header": "Medical Diagnosis Assistant",
        "page1_subheader": "Experience the future of healthcare with our ChatGPT-powered <br>medical diagnostic and symptom checking tool.", 
        "htu_0": "How to use this app:", 
        "htu_1": "Fill out the report below (some symptoms are at least required)", 
        "htu_2": "Check the summary of the report", 
        "htu_3": "Submit the report (None of the provided data are saved or shared)",
        "report_header": "Report",
        "gender": "Gender", 
        "male": "Male",
        "female": "Female", 
        "age": "Age", 
        "pregnant": "Pregnant", 
        "no": "No", 
        "yes": "Yes", 
        "history": "History", 
        "hist_example": "(Example: gone to an outdoor music festival in north america, shared drinks and cigarettes with friends with similar symptoms)",
        "hist_ph": "none", 
        "hist_help": "Enter patient's known background information, including their past medical conditions, medications, family history, lifestyle, and other relevant information that can help in diagnosis and treatment", 
        "symptoms": "Symptoms", 
        "symp_example": "(Example: high-grade fever, lethargy, headache, and abdominal pain for two days)",
        "symp_ph": "none", 
        "symp_help": "List all symptoms indicating the presence of an underlying medical condition", 
        "exam": "Examination findings", 
        "exam_example": "(Example: petechial lesions on the palms of his hands and feet, bug bites)",
        "exam_ph": "none", 
        "exam_help": "List all the information gathered through visual inspection, palpation, percussion, and auscultation during the examination", 
        "lab": "Laboratory test results", 
        "lab_example": "(Example: w/IgE levels > 3000 IU/m)",
        "lab_ph": "none", 
        "lab_help": "List output of tests performed on samples of bodily fluids, tissues, or other substances to help diagnose, monitor, or treat medical conditions. These tests can include blood tests, urine tests, imaging tests, biopsies, and other diagnostic procedures", 
        "summary": "Summary",
        "vissum_patient": "Patient: ",
        "vissum_yrsold": " years old",
        "vissum_pregnancy": "Pregnancy: ", 
        "vissum_history": "History: ",
        "vissum_symp": "Symptoms: ",
        "vissum_exam": "Examination findings: ",  
        "vissum_lab": "Laboratory test results: ", 
        "submit": "SUBMIT", 
        "submit_help": "Submit the report for diagnostic",
        "diagnostic": "Diagnostic", 
        "none": "none", 
        "submit_warning": "Please, enter at least some symptoms before submission.",
        "submit_wait": "Please wait...", 
        "caution": "Caution message",
        "caution_message": "Please be aware that while the app is designed to assist medical decision-making and check symptoms, the final diagnosis should be made by a licensed medical professional. We recommend seeking additional evaluations and opinions before making any treatment decisions.  ",     
        "no_response": "The server does not respond or is overloaded with requests... Try again.", 
        "no_diagnostic": "No diagnostic yet. Please fill out the report and click SUBMIT above.", 
        "language_selection": "Select a language: ", 
        "invest": "Invest in your health, and support our mission in keeping the MDxApp free!"
    },
    "Français": {
        "page1_title": "Assistant Diagnostic",
        "bmc_0": "Gardons MDxApp gratuit!",
        "bmc_1": "En cliquant ici:",
        "bmc_2": "Ou en utilisant ce QR code:",
        "page1_header": "Assistant Diagnostic Médical",
        "page1_subheader": "Expérimentez le futur des soins médicaux avec notre outil de<br>diagnostic médical et vérificateur de symptômes supporté par ChatGPT.", 
        "htu_0": "Comment utiliser cette application:", 
        "htu_1": "Remplir le rapport ci-dessous (certains symptômes sont au moins obligatoires)", 
        "htu_2": "Vérifier le résumé du rapport", 
        "htu_3": "Soumettre le rapport (aucune des données fournies n'est sauvegardée ou partagée)",
        "report_header": "Rapport",
        "gender": "Genre", 
        "male": "Masculin",
        "female": "Féminin", 
        "age": "Âge", 
        "pregnant": "Enceinte", 
        "no": "Non", 
        "yes": "Oui", 
        "history": "Historique", 
        "hist_example": "(Exemple : participation à un festival de musique en plein air en Amérique du Nord, partage de boissons et de cigarettes avec des amis présentant des symptômes similaires)",
        "hist_ph": "aucun", 
        "hist_help": "Saisir les informations de base connues du patient, y compris ses antécédents médicaux, ses médicaments, ses antécédents familiaux, son mode de vie et d'autres informations pertinentes susceptibles d'aider au diagnostic et au traitement.", 
        "symptoms": "Symptômes", 
        "symp_example": "(Exemple : forte fièvre, léthargie, maux de tête et douleurs abdominales pendant deux jours)",
        "symp_ph": "aucun", 
        "symp_help": "Énumérer tous les symptômes indiquant la présence d'une affection sous-jacente", 
        "exam": "Résultats de l'examen", 
        "exam_example": "(Exemple : lésions pétéchiales sur la paume des mains et des pieds, piqûres d'insectes)",
        "exam_ph": "aucun", 
        "exam_help": "Énumérer toutes les informations recueillies par l'inspection visuelle, la palpation, la percussion et l'auscultation au cours de l'examen.", 
        "lab": "Résultats des tests de laboratoire", 
        "lab_example": "(Exemple : taux d'IgE > 3000 UI/m)",
        "lab_ph": "aucun", 
        "lab_help": "Liste des tests effectués sur des échantillons de fluides corporels, de tissus ou d'autres substances pour aider à diagnostiquer, surveiller ou traiter des conditions médicales. Ces tests peuvent comprendre des analyses de sang, d'urine, d'imagerie, des biopsies et d'autres procédures de diagnostic.", 
        "summary": "Résumé",
        "vissum_patient": "Patient: ",
        "vissum_yrsold": " ans",
        "vissum_pregnancy": "Grossesse: ", 
        "vissum_history": "Historique: ",
        "vissum_symp": "Symptômes: ",
        "vissum_exam": "Résultats de l'examen: ",  
        "vissum_lab": "Résultats des tests de laboratoire: ", 
        "submit": "SOUMETTRE", 
        "submit_help": "Soumettre le rapport pour diagnostic",
        "diagnostic": "Diagnostic", 
        "none": "aucun", 
        "submit_warning": "Veuillez saisir au moins quelques symptômes avant la soumission.",
        "submit_wait": "Veuillez patienter...", 
        "caution": "Message d'avertissement",
        "caution_message": "Bien que l'application soit conçue pour aider à la prise de décision médicale et à la vérification des symptômes, le diagnostic final doit être posé par un professionnel de la santé agréé. Nous recommandons de demander des évaluations et des avis supplémentaires avant de prendre toute décision de traitement.  ",     
        "no_response": "Le serveur ne répond pas ou est surchargé de demandes... Réessayez.", 
        "no_diagnostic": "Pas encore de diagnostic. Veuillez remplir le rapport et cliquer sur SOUMETTRE ci-dessus.", 
        "language_selection": "Sélectionner une langue: ", 
        "invest": "Investissez dans votre santé et soutenez notre mission en gardant le MDxApp gratuit!"
    }, 
    "日本語": {
        "page1_title": "診断アシスタント",
        "bmc_0": "MDxAppを無料で使い続けよう!",
        "bmc_1": "こちらをクリックしてください：",
        "bmc_2": "またはこちらのQRコードをご利用ください:",
        "page1_header": "医療診断アシスタント",
        "page1_subheader": "ChatGPTを搭載した<br>医療診断・症状チェックツールで、未来の医療を体験してください。", 
        "htu_0": "このアプリの使い方", 
        "htu_1": "以下のレポートに必要事項を記入する（一部の症状は最低限必要です）", 
        "htu_2": "レポートの概要を確認する", 
        "htu_3": "報告書を提出する（提供されたデータは一切保存・共有されない）",
        "report_header": "報告書",
        "gender": "性別", 
        "male": "男",
        "female": "女", 
        "age": "年齢", 
        "pregnant": "妊娠中", 
        "no": "いいえ", 
        "yes": "はい", 
        "history": "沿革", 
        "hist_example": "(例：北米の野外音楽フェスティバルに行き、同じような症状の友人と酒やタバコを共有した。)",
        "hist_ph": "とも", 
        "hist_help": "患者さんの既知の背景情報（過去の病状、投薬、家族歴、ライフスタイル、その他診断や治療に役立つ関連情報など) を入力します。", 
        "symptoms": "症状について", 
        "symp_example": "(例:高熱、だるさ、頭痛、腹痛が2日間続く)。",
        "symp_ph": "とも", 
        "symp_help": "基礎疾患の存在を示すすべての症状を列挙する。", 
        "exam": "検査所見", 
        "exam_example": "(例：手のひらや足の裏の点状病変、虫刺され)。",
        "exam_ph": "とも", 
        "exam_help": "検査中に視診、触診、打診、聴診で収集した情報をすべてリストアップする。", 
        "lab": "臨床検査結果", 
        "lab_example": "(例:IgE値3000IU/m以上の方)",
        "lab_ph": "とも", 
        "lab_help": "病状を診断、監視、または治療するために、体液、組織、またはその他の物質のサンプルに対して行われる検査の出力をリストアップする。これらの検査には、血液検査、尿検査、画像検査、生検、およびその他の診断手順が含まれる。", 
        "summary": "概要",
        "vissum_patient": "患者さんです： ",
        "vissum_yrsold": " 歳",
        "vissum_pregnancy": "妊娠中です： ", 
        "vissum_history": "歴史がある： ",
        "vissum_symp": "症状です： ",
        "vissum_exam": "検査所見： ",  
        "vissum_lab": "臨床検査の結果： ", 
        "submit": "サブミット", 
        "submit_help": "診断用レポートの提出",
        "diagnostic": "ダイアグノスティック", 
        "none": "とも", 
        "submit_warning": "送信前に、少なくともいくつかの症状を入力してください。",
        "submit_wait": "お待ちください...", 
        "caution": "注意メッセージ",
        "caution_message": "このアプリは、医学的な判断を支援し、症状をチェックするために設計されていますが、最終的な診断は、ライセンスを持つ医療専門家によって行われる必要があることをご承知おきください。治療を決定する前に、追加の評価や意見を求めることをお勧めします。 ",     
        "no_response": "サーバーが応答しないか、リクエストで負荷がかかっている...。再度お試しください。", 
        "no_diagnostic": "まだ診断していません。レポートに必要事項を記入し、上のサブミットをクリックしてください。", 
        "language_selection": "言語を選択する： ", 
        "invest": "あなたの健康に投資し、MDxAppの無料化を維持する私たちの使命をサポートしてください!"
    }, 
    "Español": {
        "page1_title": "Asistente de diagnóstico",
        "bmc_0": "¡Mantengamos MDxApp libre!",
        "bmc_1": "Haciendo clic aquí:",
        "bmc_2": "O utiliza este código QR:",
        "page1_header": "Asistente de diagnóstico médico",
        "page1_subheader": "Experimente el futuro de la asistencia sanitaria con nuestra herramienta <br>de diagnóstico médico y comprobación de síntomas basada en ChatGPT.", 
        "htu_0": "Cómo utilizar esta aplicación:", 
        "htu_1": "Rellene el siguiente informe (algunos síntomas son como mínimo obligatorios)", 
        "htu_2": "Consultar el resumen del informe", 
        "htu_3": "Enviar el informe (no se guarda ni se comparte ninguno de los datos proporcionados)",
        "report_header": "Informe",
        "gender": "Género", 
        "male": "Hombre",
        "female": "Mujer", 
        "age": "Edad", 
        "pregnant": "Embarazada", 
        "no": "No", 
        "yes": "Sí", 
        "history": "Historia", 
        "hist_example": "(Ejemplo: ir a un festival de música al aire libre en Norteamérica, compartir bebidas y cigarrillos con amigos con síntomas similares)",
        "hist_ph": "ninguno", 
        "hist_help": "Introducir los antecedentes conocidos del paciente, incluidos sus antecedentes médicos, medicamentos, antecedentes familiares, estilo de vida y otra información pertinente que pueda ayudar en el diagnóstico y el tratamiento.", 
        "symptoms": "Síntomas", 
        "symp_example": "(Ejemplo: fiebre alta, letargo, dolor de cabeza y dolor abdominal durante dos días)",
        "symp_ph": "ninguno", 
        "symp_help": "Enumere todos los síntomas que indiquen la presencia de una enfermedad subyacente", 
        "exam": "Resultados del examen", 
        "exam_example": "(Ejemplo: lesiones petequiales en las palmas de las manos y los pies, picaduras de insectos)",
        "exam_ph": "ninguno", 
        "exam_help": "Enumerar toda la información obtenida mediante inspección visual, palpación, percusión y auscultación durante la exploración.", 
        "lab": "Resultados de las pruebas de laboratorio", 
        "lab_example": "(Ejemplo: con niveles de IgE > 3000 UI/m)",
        "lab_ph": "ninguno", 
        "lab_help": "Lista de pruebas realizadas con muestras de fluidos corporales, tejidos u otras sustancias para ayudar a diagnosticar, controlar o tratar enfermedades. Estas pruebas pueden incluir análisis de sangre, análisis de orina, pruebas de imagen, biopsias y otros procedimientos diagnósticos.", 
        "summary": "Resumen",
        "vissum_patient": "Paciente: ",
        "vissum_yrsold": " años",
        "vissum_pregnancy": "Embarazo: ", 
        "vissum_history": "Historia: ",
        "vissum_symp": "Síntomas: ",
        "vissum_exam": "Hallazgos del examen: ",  
        "vissum_lab": "Resultados de pruebas de laboratorio: ", 
        "submit": "ENVIAR", 
        "submit_help": "Presentar el informe para diagnóstico",
        "diagnostic": "Diagnóstico", 
        "none": "ninguno", 
        "submit_warning": "Por favor, introduzca al menos algunos síntomas antes de la presentación.",
        "submit_wait": "Por favor, espere...", 
        "caution": "Mensaje de precaución",
        "caution_message": "Tenga en cuenta que, aunque la aplicación está diseñada para ayudar en la toma de decisiones médicas y comprobar los síntomas, el diagnóstico final debe realizarlo un profesional médico autorizado. Recomendamos buscar evaluaciones y opiniones adicionales antes de tomar cualquier decisión de tratamiento.  ",     
        "no_response": "El servidor no responde o está sobrecargado de peticiones... Inténtelo de nuevo.", 
        "no_diagnostic": "Aún no hay diagnóstico. Por favor, rellene el informe y haga clic en ENVIAR arriba.", 
        "language_selection": "Selecciona un idioma: ", 
        "invest": "¡Invierte en tu salud y apoya nuestra misión para que MDxApp siga siendo gratuita!"
    }, 
    "Deutsch": {
        "page1_title": "Diagnose-Assistent",
        "bmc_0": "Halten wir MDxApp frei!",
        "bmc_1": "Klicken Sie hier:",
        "bmc_2": "Oder verwenden Sie diesen QR-Code:",
        "page1_header": "Assistentin für medizinische Diagnostik",
        "page1_subheader": "Erleben Sie die Zukunft des Gesundheitswesens mit unserem ChatGPT-gestützten <br>Medizinischen Diagnose- und Symptomprüfungs-Tool.", 
        "htu_0": "So verwenden Sie diese App:", 
        "htu_1": "Füllen Sie den nachstehenden Bericht aus (einige Symptome sind mindestens erforderlich)", 
        "htu_2": "Prüfen Sie die Zusammenfassung des Berichts", 
        "htu_3": "Senden Sie den Bericht (keine der bereitgestellten Daten werden gespeichert oder weitergegeben)",
        "report_header": "Bericht",
        "gender": "Geschlecht", 
        "male": "Männlich",
        "female": "Weiblich", 
        "age": "Alter", 
        "pregnant": "Schwangere", 
        "no": "Nein", 
        "yes": "Ja", 
        "history": "Geschichte", 
        "hist_example": "(Beispiel: Besuch eines Open-Air-Musikfestivals in Nordamerika, gemeinsame Nutzung von Getränken und Zigaretten mit Freunden mit ähnlichen Symptomen)",
        "hist_ph": "keine", 
        "hist_help": "Geben Sie die bekannten Hintergrundinformationen des Patienten ein, einschließlich früherer Erkrankungen, Medikamente, Familiengeschichte, Lebensstil und anderer relevanter Informationen, die bei der Diagnose und Behandlung helfen können.", 
        "symptoms": "Symptome", 
        "symp_example": "(Beispiel: hohes Fieber, Lethargie, Kopf- und Bauchschmerzen über zwei Tage)",
        "symp_ph": "keine", 
        "symp_help": "Führen Sie alle Symptome auf, die auf eine Grunderkrankung hinweisen", 
        "exam": "Untersuchungsergebnisse", 
        "exam_example": "(Beispiel: petechiale Läsionen an den Hand- und Fußflächen, Insektenstiche)",
        "exam_ph": "keine", 
        "exam_help": "Auflistung aller Informationen, die während der Untersuchung durch visuelle Inspektion, Palpation, Perkussion und Auskultation gewonnen wurden", 
        "lab": "Ergebnisse von Laboruntersuchungen", 
        "lab_example": "(Beispiel: mit IgE-Werten > 3000 IU/m)",
        "lab_ph": "keine", 
        "lab_help": "Liste der Tests, die an Proben von Körperflüssigkeiten, Geweben oder anderen Substanzen durchgeführt werden, um die Diagnose, Überwachung oder Behandlung von Krankheiten zu unterstützen. Diese Tests können Bluttests, Urintests, bildgebende Tests, Biopsien und andere diagnostische Verfahren umfassen", 
        "summary": "Zusammenfassung",
        "vissum_patient": "Patient: ",
        "vissum_yrsold": " Jahre",
        "vissum_pregnancy": "Schwangerschaft: ", 
        "vissum_history": "Geschichte: ",
        "vissum_symp": "Die Symptome: ",
        "vissum_exam": "Untersuchungsergebnisse: ",  
        "vissum_lab": "Ergebnisse der Labortests: ", 
        "submit": "SUBMIT", 
        "submit_help": "Übermittlung des Berichts zur Diagnose",
        "diagnostic": "Diagnostik", 
        "none": "keine", 
        "submit_warning": "Bitte geben Sie vor der Einsendung zumindest einige Symptome an.",
        "submit_wait": "Bitte warten Sie...", 
        "caution": "Vorsichtige Meldung",
        "caution_message": "Bitte beachten Sie, dass die App zwar dazu dient, medizinische Entscheidungen zu treffen und Symptome zu überprüfen, die endgültige Diagnose jedoch von einem zugelassenen Arzt gestellt werden sollte. Wir empfehlen, zusätzliche Untersuchungen und Meinungen einzuholen, bevor Sie eine Behandlungsentscheidung treffen.  ",     
        "no_response": "Der Server antwortet nicht oder ist mit Anfragen überlastet... Versuchen Sie es erneut.", 
        "no_diagnostic": "Noch keine Diagnose. Bitte füllen Sie den Bericht aus und klicken Sie oben auf SUBMIT.", 
        "language_selection": "Wählen Sie eine Sprache: ", 
        "invest": "Investieren Sie in Ihre Gesundheit und unterstützen Sie unsere Mission, die MDxApp kostenlos zu halten!"
    }
}
